package javaexpz01_homework;

public class A0504 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
//		2022-05-04
//		[1단계:개념] 1. 메서드의 기능을 기본 예제를 통해서 설명하세요

		
//		[1단계:확인] 2. [리턴유형연습] 쇼핑몰에서 구매한 물건, 가격, 갯수, 배송지를 리턴값으로 선언하는 메서드와, 
//		      리턴값이 없이 위 정보를 출력하는 메서드를 선언하세요
		
//		[1단계:확인] 3. [매개변수연습] driving메서드에 매개변수로 1~3개를 각각 선언하되,
//		      차량명, 목적지, 거리를 선언하여 출력하되 오버로딩 규칙에 따라 처리하세요.
		
//		[1단계:확인] 4. [매개변수+리턴] Student 클래스
//		      tot() 매개변수:국어,영어,수학점수 리턴값:총점수(정수)
//		      avg() 매개변수:국어,영어,수학점수 리턴값:평균값(실수)
//		      reg() 매개변수:번호,이름  리턴값:@@번 @@@(문자열)
//		      show() 매개변수:이름,국어,영어,수학  리턴값:없음, 출력:매개변수값
		
//		[1단계:확인] 5. [매개변수+리턴] Member 클래스 선언하고, regdate()메서드로
//		      회원명, 아이디, 패스워드 매개변수로 입력과 String으로 등록 내용을 리턴
//		      usePoint()메서드로 사용한 포인트를 입력받아 10%적립포인트 리턴(실수)
//		      addPoint()메서드로 추가할포인트를 입력받아 지역변수로 있는 point=1000
//		      에 추가하여 리턴처리하세요.
		
		
//		[1단계:확인] 6. [매개변수+필드] Coffee 클래스 선언, 
//		      필드 : 주문커피종류, 주문 가격, 주문 갯수
//		      메서드 : orderName - 주문커피종류 저장
//		             orderCoffee - 주문커피종류, 가격, 갯수 저장
//		             getPay - 총비용(가격*갯수) 리턴
//		             getName() - 주문커피종류 리턴
//		             showAll() - 저장된 주문커피종류,가격,갯수,총액 문자열리턴
	
		
//		[1단계:확인] 7. [필드+로직처리] Gugu 클래스 선언
//		           필드 : 단수, 시작단수, 마지막단수
//		      메서드 : schGrade - 단수지정
//		             showResult - 해당 단수의 1~9까지 연산 출력
//		                       setFromTo - 시작단수,마지막단수 지정
//		             showResult2 - 범위가 있는 단수 출력
		
		
//		[1단계:확인] 8. [필드+로직처리] Bus 클래스 선언
//		      필드 : 버스번호, 구간, 비용
//		      메서드 : basicInfo - 입력 버스번호, 구간, 비용
//		             takeBus - 입력 : 인원수 리턴:비용*인원수
//		                 화면 출력 : 구간 @@ 인  @@번 @@명 탑승
	}

}
