--2022-05-17
-- empno(사원번호), ename(사원명), job(직책), mgr(관리자번호), hiredate(입사일), sal(급여), comm(보너스), deptno(부서번호)
--[1단계:개념] 1. 특정 DB서버에 접속에 필요한 정보는 무엇이 있는가를 기술해 보세요.
--[1단계:개념] 2. select 구문의 컴럼 선택과 별칭사용에 대하여 예제를 통하여 설명하세요.
SELECT empno 사원번호, -- 컬럼 별칭
		ename "사 원 명", -- 컬럼 "별칭" (띄어쓰기, 특수문자 사용시 " " 사용)
		job "#직책#"
FROM emp;
--[1단계:확인] 3. emp 테이블의 컬럼명을 한글로 표현해보세요. ex) 사원번호, 사원명, 직책, 관리자, 입사일, 급여, 보너스, 부서번호
SELECT empno 사원번호, ename 사원명, job 직책, mgr 관리자, hiredate 입사일, sal 급여, comm 보너스, deptno 부서번호
FROM emp;
--[1단계:확인] 4. sal를 부서번호로 부너번호%로 보너스처리하여 급여를 정하기로 했다.  sal==> 기본급여, deptno ==> 보너스, 총급여(기본급여+보너스)
--            로 처리하여 출력하되 alias명도 함께 처리하세요.
SELECT sal 기본급여, (sal*deptno%) 보너스, (sal+deptno) 총급여
FROM emp;
--[1단계:확인] 5. 아래의 형식으로 컬럼간의 연산과 연결처리를 하여 alias로 출력하세요.
--            1) @@님의 사원번호는 @@이고, 올해 연말보너스는 연봉의 20%인 @@원입니다.  @@님(ename)
--            2) @@님의 입사일은 @@이고, 현재 연봉의 1/13인 월급여는 @@만원.   입사일 @@(hiredate)
--            3) @@님의 이번달 보너스는 연봉(sal)의 deptno%기준으로  @@@만원 지급합니다. 
--[1단계:개념] 6. distinct로 데이터를 처리해야 하는 경우를 기본예제를 통해서 설명하세요.
--[1단계:개념] 7. 기본 유형을 Wrapper 클래스로 만드는 이유를 설명하세요.
--[1단계:확인] 8. 아래의 기본유형의 문자열을 Wrapper클래스의 valueOf 메서드를 이용해서 Wrapper클래스로 만들어 보세요.
--                (Integer,Character,Boolean)
--[1단계:개념] 9. boxing, unboxing, auto boxing/auto unboxing 개념에 대하여 기본예제로 기술하세요.
--[1단계:개념] 10. 컬렉션 프레임 웍의 최상위 인터페이스 3가지와 그 특징을 기술하세요.
--[1단계:확인] 11. List기능 메서드를 예제를 통하여 설명하세요
                